load-tests/700-users.yml
config:
  target: "http://localhost:4000"

  phases:
    - name: "Ramp to 700 Players"
      duration: 60
      arrivalRate: 12

    - name: "Hold 700 Players"
      duration: 60
      arrivalRate: 12

  engines:
    socketio:
      path: "/socket.io"
      transports:
        - websocket
        - polling

scenarios:
  - name: "Join Quiz"
    engine: socketio

    flow:
      - emit:
          channel: "player:join"
          data:
            pin: "999999"
            name: "Player{{ $randomString() }}"

      - think: 30