load-tests/single-client.yml
config:
  target: "http://localhost:4000"
  socketio:
    transports:
      - "websocket"
    path: "/socket.io/"
  phases:
    - duration: 1
      arrivalCount: 1
      name: One Client Test

engines:
  socketio: {}

scenarios:
  - name: Single Client Join
    engine: socketio
    flow:
      - connect: {}
      - emit:
          channel: "player:join"
          data:
            pin: "999999"
            name: "SingleTestPlayer"
          response:
            channel: "player:joined"
      - think: 2